Material/Lecture_09/cylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (10 0 0)
    (10 1 0)
    (0 1 0)
    (0 0 0.1)
    (10 0 0.1)
    (10 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 5 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    patch1
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

     
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }


    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }


    patch4
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
