Material/Lecture_09/cylinder/system/setExprBoundaryFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprBoundaryFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pattern
{
    field   U;
    dimensions  [0 1 -1 0 0 0 0];

    expressions
    (
        {
            patch   inlet;
            target  value;
            expression #{ vector((10*sqr(sin(time()/2))), 0, 0) #};
        }

    );
}


// ************************************************************************* //
